Revit 2027 API
BuiltInFailures.SystemsFailures.CreatePartsWithInvalidSystem Property
 Parts were not created because the element does not have a valid system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CreatePartsWithInvalidSystem { get; }
Public Shared ReadOnly Property CreatePartsWithInvalidSystem As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CreatePartsWithInvalidSystem {
	FailureDefinitionId^ get ();
}
static member CreatePartsWithInvalidSystem : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SystemsFailures Class
Autodesk.Revit.DB Namespace